;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v6.2.7 *
;* Date/Time created: Mon Oct 28 19:26:04 2019                 *
;***************************************************************
	.compiler_opts --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=2 
FP	.set	XAR2

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("C:/Users/Rodrigo/Documents/bandala/CONTROLADOR/CONTROLADOR_MAGLEV (C code)/CONTROLADOR_MAGLEV.c")
	.dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.7 Copyright (c) 1996-2014 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Rodrigo\Documents\bandala\CONTROLADOR\CONTROLADOR_MAGLEV (C code)\CONTROLADOR_MAGLEV\1_RamDebug")
;**************************************************************
;* CINIT RECORDS                                              *
;**************************************************************
	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_nGblSciState+0,32
	.bits	0,16			; _nGblSciState @ 0

	.sect	".cinit"
	.align	1
	.field  	-2,16
	.field  	_fOut$3+0,32
	.xfloat	$strtod("0x0p+0")		; _fOut$3 @ 0

	.sect	".cinit"
	.align	1
	.field  	-2,16
	.field  	_fOut$2+0,32
	.xfloat	$strtod("0x0p+0")		; _fOut$2 @ 0

	.dwcfi	cfa_offset, -2
$C$DW$436	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$436, DW_AT_low_pc(0x00)
	.dwattr $C$DW$436, DW_AT_TI_return
        LRETR     ; [CPU_] 
        ; return occurs ; [] 
	.dwattr $C$DW$410, DW_AT_TI_end_file("C:/Users/Rodrigo/Documents/bandala/CONTROLADOR/CONTROLADOR_MAGLEV (C code)/CONTROLADOR_MAGLEV.c")
	.dwattr $C$DW$410, DW_AT_TI_end_line(0x287)
	.dwattr $C$DW$410, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$410

	.sect	".text"
	.clink
	.global	_main

$C$DW$437	.dwtag  DW_TAG_subprogram, DW_AT_name("main")
	.dwattr $C$DW$437, DW_AT_low_pc(_main)
	.dwattr $C$DW$437, DW_AT_high_pc(0x00)
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("_main")
	.dwattr $C$DW$437, DW_AT_external
	.dwattr $C$DW$437, DW_AT_TI_begin_file("C:/Users/Rodrigo/Documents/bandala/CONTROLADOR/CONTROLADOR_MAGLEV (C code)/CONTROLADOR_MAGLEV.c")
	.dwattr $C$DW$437, DW_AT_TI_begin_line(0x289)
	.dwattr $C$DW$437, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$437, DW_AT_TI_max_frame_size(-2)
	.dwpsn	file "C:/Users/Rodrigo/Documents/bandala/CONTROLADOR/CONTROLADOR_MAGLEV (C code)/CONTROLADOR_MAGLEV.c",line 650,column 1,is_stmt,address _main

	.dwfde $C$DW$CIE, _main

;***************************************************************
;* FNAME: _main                         FR SIZE:   0           *
;*                                                             *
;* FUNCTION ENVIRONMENT                                        *
;*                                                             *
;* FUNCTION PROPERTIES                                         *
;*                            0 Parameter,  0 Auto,  0 SOE     *
;***************************************************************

_main:
	.dwcfi	cfa_offset, -2
	.dwcfi	save_reg_to_mem, 26, 0
	.dwcfi	save_reg_to_reg, 78, 26
	.dwpsn	file "C:/Users/Rodrigo/Documents/bandala/CONTROLADOR/CONTROLADOR_MAGLEV (C code)/CONTROLADOR_MAGLEV.c",line 651,column 2,is_stmt
$C$DW$438	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$438, DW_AT_low_pc(0x00)
	.dwattr $C$DW$438, DW_AT_name("_Initialize")
	.dwattr $C$DW$438, DW_AT_TI_call
        LCR       #_Initialize          ; [CPU_] |651| 
        ; call occurs [#_Initialize] ; [] |651| 
	.dwpsn	file "C:/Users/Rodrigo/Documents/bandala/CONTROLADOR/CONTROLADOR_MAGLEV (C code)/CONTROLADOR_MAGLEV.c",line 652,column 2,is_stmt
 clrc INTM
	.dwpsn	file "C:/Users/Rodrigo/Documents/bandala/CONTROLADOR/CONTROLADOR_MAGLEV (C code)/CONTROLADOR_MAGLEV.c",line 653,column 2,is_stmt
 clrc DBGM
$C$L73:    
	.dwpsn	file "C:/Users/Rodrigo/Documents/bandala/CONTROLADOR/CONTROLADOR_MAGLEV (C code)/CONTROLADOR_MAGLEV.c",line 655,column 3,is_stmt
        SPM       #0                    ; [CPU_] 
$C$DW$439	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$439, DW_AT_low_pc(0x00)
	.dwattr $C$DW$439, DW_AT_name("__ProcSciWaitStart")
	.dwattr $C$DW$439, DW_AT_TI_call
        LCR       #__ProcSciWaitStart   ; [CPU_] |655| 
        ; call occurs [#__ProcSciWaitStart] ; [] |655| 
	.dwpsn	file "C:/Users/Rodrigo/Documents/bandala/CONTROLADOR/CONTROLADOR_MAGLEV (C code)/CONTROLADOR_MAGLEV.c",line 656,column 2,is_stmt
        B         $C$L73,UNC            ; [CPU_] |656| 
        ; branch occurs ; [] |656| 
	.dwattr $C$DW$437, DW_AT_TI_end_file("C:/Users/Rodrigo/Documents/bandala/CONTROLADOR/CONTROLADOR_MAGLEV (C code)/CONTROLADOR_MAGLEV.c")
	.dwattr $C$DW$437, DW_AT_TI_end_line(0x291)
	.dwattr $C$DW$437, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$437

;***************************************************************
;* FAR STRINGS                                                 *
;***************************************************************
	.sect	".econst:.string"
	.align	2
$C$FSL1:	.string	1,"6,1:x1=200",3,1,"6,2:x4=200",3,1,"6,3:x3=200",3,1,"1,1:en"
	.string	"=0",3,1,"6,4:x4_d=200",3,1,"1,2:F1_d=12",3,1,"1,3:F2_d=150",3
	.string	1,"6,5:x1_d=200",3,1,"6,6:u2=200",3,1,"6,7:u1=200",3,1,"6,8:"
	.string	"z2=200",3,1,"6,9:z1=200",3,1,"6,10:rho=200",3,1,"6,11:eta=2"
	.string	"00",3,0
;**************************************************************
;* UNDEFINED EXTERNAL REFERENCES                              *
;**************************************************************
	.global	_PS_SciInit
	.global	_PS_StartStopPwmClock
	.global	_PS_AdcInit
	.global	_PS_SciSendInitStr
	.global	_PS_SciClearSendBuf
	.global	_PS_ExitCapture6Intr
	.global	_PS_SetTimerIntrVector
	.global	_PS_SetCapPwmPeakOffset
	.global	_PS_SysInit
	.global	_PS_InitCapPwm
	.global	_PS_CapPwmRun
	.global	_PS_StartCapPwm
	.global	_PS_SetCapPwmIntrVector
	.global	_PS_InitTimer
	.global	_PS_ResetAdcConvSeq
	.global	_PS_SetCapPwmRate
	.global	_PS_SetAdcConvSeq
	.global	_PS_SciSendItem
	.global	_PS_IsTxQueueEmpty
	.global	_pow
	.global	_PS_GetDcAdc
	.global	FS$$DIV

;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$T$27	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
$C$DW$440	.dwtag  DW_TAG_enumerator, DW_AT_name("eAdcNotUse"), DW_AT_const_value(0x00)
$C$DW$441	.dwtag  DW_TAG_enumerator, DW_AT_name("eAdc0Intr"), DW_AT_const_value(0x01)
$C$DW$442	.dwtag  DW_TAG_enumerator, DW_AT_name("eAdc1Intr"), DW_AT_const_value(0x02)
$C$DW$443	.dwtag  DW_TAG_enumerator, DW_AT_name("eAdcCascade"), DW_AT_const_value(0x03)
	.dwendtag $C$DW$T$27

$C$DW$T$28	.dwtag  DW_TAG_typedef, DW_AT_name("PST_AdcIntrType")
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$444, DW_AT_name("nCount")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("_nCount")
	.dwattr $C$DW$444, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$445, DW_AT_name("nSeqNo")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("_nSeqNo")
	.dwattr $C$DW$445, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$20


$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$446, DW_AT_name("nSeqNo")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("_nSeqNo")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$447	.dwtag  DW_TAG_member
	.dwattr $C$DW$447, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$447, DW_AT_name("data")
	.dwattr $C$DW$447, DW_AT_TI_symbol_name("_data")
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$23

$C$DW$T$29	.dwtag  DW_TAG_typedef, DW_AT_name("PST_BufItem")
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
$C$DW$T$30	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$30, DW_AT_address_class(0x16)

$C$DW$T$31	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x4b00)
$C$DW$448	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$448, DW_AT_upper_bound(0x12bf)
	.dwendtag $C$DW$T$31


$C$DW$T$24	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
$C$DW$449	.dwtag  DW_TAG_member
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$449, DW_AT_name("all")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$450, DW_AT_name("bit")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$24

$C$DW$T$21	.dwtag  DW_TAG_typedef, DW_AT_name("PST_SeqNo")
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)

$C$DW$T$26	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$451, DW_AT_name("dataFloat")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("_dataFloat")
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$452, DW_AT_name("dataInt32")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("_dataInt32")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$26

$C$DW$T$22	.dwtag  DW_TAG_typedef, DW_AT_name("PST_Data")
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)

$C$DW$T$32	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x06)
$C$DW$453	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$453, DW_AT_upper_bound(0x02)
	.dwendtag $C$DW$T$32


$C$DW$T$38	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
$C$DW$T$39	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$39, DW_AT_address_class(0x16)
$C$DW$T$40	.dwtag  DW_TAG_typedef, DW_AT_name("IntrFunc")
	.dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)

$C$DW$T$56	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
$C$DW$454	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$30)
	.dwendtag $C$DW$T$56

$C$DW$T$57	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$57, DW_AT_address_class(0x16)
$C$DW$T$58	.dwtag  DW_TAG_typedef, DW_AT_name("PSD_ProcCmd")
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
$C$DW$T$53	.dwtag  DW_TAG_typedef, DW_AT_name("int16")
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)

$C$DW$T$77	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$77, DW_AT_byte_size(0x0b)
$C$DW$455	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$455, DW_AT_upper_bound(0x0a)
	.dwendtag $C$DW$T$77

$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
$C$DW$T$25	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32")
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
